Tekla Open API Reference for Tekla Structures 2025
ConnectiveGeometry.GetGeometryLegSections Method
 Gets geometry end GeometrySections which are possible to remove.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public IList<GeometrySection> GetGeometryLegSections()
Public Function GetGeometryLegSections As IList(Of GeometrySection)
Return Value
Type: IList<GeometrySection>
Returns List of the removable GeometrySections.
See Also
Reference
ConnectiveGeometry Class
Tekla.Structures.Model Namespace